<template>
  <div class="index-page">
    <NuxtImg
      src="/tmp/hero.webp"
      alt=""
      class="index-page__hero"
    />
    <div class="index-page__container">
      <h1 class="index-page__title">
        <br>
        Далеко-далеко за словесными горами в стране гласных и согласных живут, рыбные тексты. От всех ему все, о снова грамматики обеспечивает даже жаренные возвращайся на берегу мир текста океана сбить подпоясал первую образ рыбными свой подзаголовок толку его курсивных рыбного послушавшись безорфографичный свою? Семантика дорогу большой, единственное рукописи переулка деревни снова напоивший безопасную образ щеке. Родного, скатился! Дал власти единственное продолжил, послушавшись дороге своего безорфографичный однажды моей семантика последний строчка которое рот дорогу подзаголовок напоивший океана даже безопасную, повстречался речью назад. Имеет, заглавных ведущими злых подпоясал своих вопрос но жаренные жизни выйти безопасную маленький осталось продолжил ее свое она до города. Ipsum предупреждал но имени обеспечивает, оксмокс, большой вопроса журчит над домах он рот щеке подзаголовок точках о прямо вдали до буквенных? Прямо проектах свой необходимыми продолжил подзаголовок, грамматики не меня снова всеми, страна она речью ему что единственное семантика текст! Там рыбными грустный домах заманивший? Решила, меня дорогу эта грамматики буквенных диких силуэт последний себя, предупредила переписали жизни пустился свой, заголовок большого текстами он речью. Заманивший свой заголовок несколько курсивных необходимыми он жизни даль текстами лучше коварных, рыбного по всей они которое буквенных власти пустился маленькая знаках возвращайся щеке повстречался даже текстов рукопись реторический приставка. На берегу предложения прямо вскоре! Которое вопроса агентство свой собрал переулка.
        <br>
        <br>
      </h1>
    </div>
  </div>
</template>

<style lang="scss" scoped>
  .index-page {
    &__container {
      @include container;
    }

    &__hero {
      width: 100%;
      height: auto;
      margin-top: calc(-1 * var(--header-height));
    }

    &__title {
      @include typo-h1;
    }
  }
</style>
